<script setup lang="ts">
import CalculatedTabContent from '@/components/CalculatedTabContent.vue'
import ChemElementInfoBlock from '@/components/ChemElementInfoBlock.vue'
import { useHeightNormalizerStore } from '@/store/height-normalizer-store'
import { onMounted } from 'vue'

const heightStore = useHeightNormalizerStore()

onMounted(() => {
  heightStore.calculateContentHeight()
})
</script>

<template>
  <div class="tab-content-root">
    <h1>Справочник веществ и элементов</h1>
    <CalculatedTabContent class="chem-info-table">
      <ChemElementInfoBlock element="H">
        <span>Водород</span>
        Самый распространенный элемент на Земле. Атомы в молекуле связаны одинарной связью. Имеет
        низкие температуры кипения и плавления. Незначительно расстворяется в воде при комнатной
        температуре. Самый легкий газ. Может восстанавливать некоторые металлы из их оксидов.
        Является экологически чистым топливом. Образуется в результате реакции раскаленного железа с
        парами воды. В химических реакциях пероксид водорода может выступать как в роли окислителя(с
        металлами), так и восстановителя(с неметаллами). При взаимодействии азота с водородом
        образуется аммиак. Реагирует с кислородом с образованием воды.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="B">
        <span>Бор</span>
        Имеет атомную кристаллическую решетку.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="C">
        <span>Углерод</span>
        Имеет аллотропные модификации, к которым относятся алмаз и графит, при этом атомы углерода в
        графите и алмазе имеют одинаковую степень окисления. В алмазе атом углерода имеет степень
        окисления 0, 4 ковалентные связи с другими атомами углерода, а валентность 4. Твердость
        алмаза значительно выше, чем графита. В соединениях проявляет как окислительные(карбины),
        так и восстановительные свойства(органические вещества, оксид углерода(II), оксид
        углерода(IV)).
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="N">
        <span>Азот</span>
        В молекуле имеется кратная(тройная) связь. Связь в молекуле азота прочнее, чем в молекулах
        H2 и O2, т.к. она тройная. В природе встречается в составе как простого, так и сложных
        веществ. Используется для создания инертной среды. Молекула азота не имеет аллотропных
        модификаций, составляет основную часть воздуха(78%) и состоит из неполярных единиц.
        Образуется при горении аммиака в кислороде. Является газом(н.у.) без цвета и запаха. При
        сгорании аминов в кислороде в качестве одного из продуктов окисления образуется азот. С
        кислородом взаимодействует при очень высоких температурах, при этом образуется NO.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="O">
        <span>Кислород</span>
        Плохо расстворим в воде. Образуется в процессе фотосинтеза. Объемная доля в воздухе
        составляет 21%. Образует две аллотропные модификации - кислород(O2) и озон(O3). Кислород -
        бесцветный газ, а озон имеет голубой цвет. Температура кипения озона выше, чем кислорода.
        Плотность кислорода ниже, чем озона(при н.у.). В отличие от кислорода озон реагирует с
        серебром при комнатной температуре.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="Si">
        <span>Кремний</span>
        Является полупроводником. Встречается в природе как в виде простого вещества, так и в
        соединениях. Простое вещество имеет атомную кристаллическую решетку(немолекулярное
        строение). При комнатной температуре не расстворяется в воде. Реагирует как с металлами, так
        и с неметаллами.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="S">
        <span>Сера</span>
        Моноклинная и ромбическая сера состоят из молекул S8.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="Cl">
        <span>Хлор</span>
        При н.у. является желто-зеленым газом с резким запахом. Вытесняет йод и бром из солей. Не
        встречается в природе в виде простого вещества. Существует только в виде двух атомных
        молекул.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="Br">
        <span>Бром</span>
        При н.у. - красно-бурая жидкость с резким запахом. Встречается в морской воде. Не
        встречается в природе в виде простого вещества. Существует в виде двух атомных молекул.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="I">
        <span>Йод</span>
        При н.у. - кристаллы черно-фиолетового цвета.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="Hg">
        <span>Ртуть</span>
        Один из самых легкоплавких металлов.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="азотная кислота" longText>
        <span>HNO3</span>
        В концентрированном виде пассивирует аллюминий, хром, железо, свинец, бериллий и никель.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="анилин" longText>
        <span>C6H5NH2</span>
        Относится к ароматическим соединениям, но не к углеводородам. Не реагирует с водными
        расстворами щелочей(т.к. сам обладает основными свойствами). Ограниченно расстворим в воде.
        В реакции с расствором брома в воде образуется белый осадок(2,4,6 - триброманилин). Вступает
        в реакцию замещения с бромной водой.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="глицин" longText>
        <span>CH2NH2COOH</span>
        Хорошо расстворяется в воде. Реагирует как с кислотами, так и с щелочами. Взаимодействует с
        другими аминокислотами. Можно получить ферментативным гидролизом пептидов.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="изопрен" longText>
        <span>C5H8</span>
        Относится к ненасыщенным углеводородам. Является мономером каучука. Имеет название
        2-метилбутадиен-1,3.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="крахмал" longText>
        <span>(C6H10O5)n</span>
        Не имеет альдегидной группы, поэтому не окисляется гидроксидом меди и оксидом серебра. В
        результате кислотного гидролиза превращается в глюкозу. Образует синий комплекс с йодом.
        Относится к природным полимерам.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="оксид кремния(IV)" longText>
        <span>SiO2</span>
        Имеет атомную кристаллическую решетку. Несолеобразующий оксид. Является кислотным оксидом.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="сахароза" longText>
        <span>C12H22O11</span>
        Дисахарид, состоящий из остатков фруктозы и глюкозы. Вступает в реакцию кислотного
        гидролиза, распадаясь на глюкозу и сахарозу. Относится к невосстанавливающим углеводам.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="сернистый газ" longText>
        <span>H2S</span>
        Имеет характерный запах тухлых яиц. Молекула имеет угловое строение. Его водный расствор
        является слабым электролитом. Может образовывать два типа солей: среднюю и кислую.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="соляная кислота" longText>
        <span>HCl</span>
        Представляет собой смесь веществ.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="угарный газ" longText>
        <span>CO</span>
        Образуется при неполном сгорании углерода. Используется в качестве восстановителя металлов.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="уксусная кислота" longText>
        <span>CH3COOH</span>
        Изменяет окраску водного расствора лакмуса на красную. Является слабой органической
        кислотой. Смешивается с водой в любых соотношениях. Используется при производстве
        искуственного шелка.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="фенол" longText>
        <span>C6H5OH</span>
        Имеет твердое агрегатное состояние(при н.у.). Относится к ароматическим соединениям, но не к
        углеводородам. Не реагирует с водными расстворами щелочей(т.к. сам обладает основными
        свойствами). В реакции с расствором брома в воде образуется белый осадок(2,4,6 -
        трибромфенол). Вступает в реакцию замещения с бромной водой. Реагирует с водными расстворами
        щелочей. Используется в производстве пластмасс.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="фосфорная кислота" longText>
        <span>H3PO4</span>
        В водном расстворе диссоциирует с образованием трех видов анионов.
      </ChemElementInfoBlock>
      <ChemElementInfoBlock element="фенол" longText>
        <span>C6H5OH</span>
        Имеет твердое агрегатное состояние(при н.у.). Относится к ароматическим соединениям, но не к
        углеводородам. Не реагирует с водными расстворами щелочей(т.к. сам обладает основными
        свойствами). В реакции с расствором брома в воде образуется белый осадок(2,4,6 -
        трибромфенол). Вступает в реакцию замещения с бромной водой. Реагирует с водными расстворами
        щелочей. Используется в производстве пластмасс.
      </ChemElementInfoBlock>
      <div>Солеобразующие оксиды: SO2, SO3, CO2, SiO2, P2O5, N2O5, NO2, Cl2O7, Cl2O3.</div>
      <div>Несолеобразующие оксиды: CO, NO, N2O, SiO.</div>
      <div>
        Методом вытеснения воды можно собрать газы, которые в ней не расстворяются(H2, O2, CH4, N2,
        PH3, CO, NO, N2O).
      </div>
      <div>
        Если газ легче воздуха, то сосуд для его собирания закрепляют дном вверх, а если газ тяжелее
        воздуха - дном вниз.
      </div>
      <div>
        Водородная связь образуется между молекулами спиртов и воды, фтороводорода и воды, аммиака и
        воды.
      </div>
      <div>
        В окислительно-восстановительных реакциях не расписываются осадки, оксиды, вода,
        слабодиссоциирующие соединения(H2S, HNO2, H3PO4), а гидроксид кальция расписывается только
        до стрелки, т.к. является малорастворимым веществом. Сернистая кислота(H2SO3) расадается на
        SO2 и H2O, угольная кислота(H2CO3) - н CO2 и H2O, а гидроксид аммония - на NH3 и H2O.
      </div>
      <div>
        Температура кипения зависит от агрегатного состояния вещества в следующей
        последовательности: газ - жидкость - твердое вещество, температура кипения возрастает
        соответственно.
      </div>
    </CalculatedTabContent>
  </div>
</template>

<style scoped>
.chem-info-table span {
  font-weight: bold;
}

.chem-info-table div {
  margin-bottom: var(--outter-padding);
}

.chem-info-table div:last-child {
  margin-bottom: 0;
}
</style>
